{
  "lastmodified": {
    "date": "2014-12-05",
    "label" : "Last modified"
  },
  "orderLabel":"Choose publication type",
  "allTypesLabel":"All types",
  "searchLabel":"Search publications",
  "items": [
    {
      "id": "24444",
      "title": "Fast Exact Euclidean Distance (FEED)",
      "subtitle": "A new class of adaptable distance transforms.",
      "reference": "Schouten, Th.E. and van den Broek, E.L. (2014) Fast Exact Euclidean Distance (FEED): A new class of adaptable distance transforms. IEEE transactions on pattern analysis and machine intelligence, 36 (11). pp. 2159-2172. ISSN 0162-8828",
      "abstract": "A new unique class of foldable distance transforms of digital images (DT) is introduced, baptized: Fast Exact Euclidean Distance (FEED) transforms. FEED class algorithms calculate the DT starting directly from the definition or rather its inverse. The principle of FEED class algorithms is introduced, followed by strategies for their efficient implementation. It is shown that FEED class algorithms unite properties of ordered propagation, raster scanning, and independent scanning DT. Moreover, FEED class algorithms shown to have a unique property: they can be tailored to the images under investigation. Benchmarks are conducted on both the Fabbri et al. data set and on a newly developed data set. Three baseline, three approximate, and three state-of-the-art DT algorithms were included, in addition to two implementations of FEED class algorithms. It illustrates that FEED class algorithms i) provide truly exact Euclidean DT; ii) do no suffer from disconnected Voronoi tiles, which is a unique feature for non-parallel but fast DT; iii) outperform any other approximate and exact Euclidean DT with its time complexity O(N), even after their optimization; and iv) are unequaled in that they can be adapted to the characteristics of the image class at hand. The source code of all algorithms included as well as the data sets used for both benchmarks are provided as supplementary material to this article.",
      "type": "Journal paper",
      "researchgroup": "EWI-HMI: Human Media Interaction",
      "researchprogram": "CTIT-NICE: Natural Interaction in Computer-mediated Environments",
      "researchproject": "COMMIT/P04+P05: Virtual Worlds for Well-being",
      "additionalinfo": "This version is a slightly improved version, compared to the originally version published by IEEE.",
      "keywords": "Fast Exact Euclidean Distance (FEED), distance transform, distance transformation, Voronoi, computational complexity, adaptive, benchmark",
      "status": "Published",
      "deposited": "2014-02-20",
      "year": 2014,
      "refereed": "Yes",
      "international": "Yes",
      "isi": "4.80",
      "urls": {
        "doi": "http://dx.doi.org/10.1109/TPAMI.2014.25",
        "pdf": "http://eprints.eemcs.utwente.nl/24444/01/Schouten_VandenBroekXX-Fast_Exact_Euclidean_Distance_FEED_IMPROVED-VERSION.pdf"
      }
    },
    {
      "id": "24737",
      "title": "When complexity becomes interesting",
      "reference": "van der Sluis, F. and van den Broek, E.L. and Glassey, R.J. and van Dijk, E.M.A.G. and de Jong, F.M.G. (2014) When complexity becomes interesting. Journal of the Association for Information Science and Technology, 65 (7). pp. 1478-1500. ISSN 2330-1643",
      "abstract": "How to provide users a positive experience during interaction with information (i.e., the “Information eXperience” (IX)) is still an open question. As a starting point, this work investigates how the emotion of interest can be influenced by modifying the complexity of the information presented to users. The appraisal theory of interest suggests a “sweet spot” where interest will be at its peak: information that is novel and complex yet still comprehensible. This “sweet spot” is approximated using two studies. Study One develops a computational model of textual complexity founded on psycholinguistic theory on processing difficulty. The model was trained and tested on 12,420 articles, achieving a classification performance of 90.87% on two classes of complexity. Study Two puts the model to its ultimate test: Its application to change the user's IX. Using 18 news articles the influence of complexity on interest and its appraisals is unveiled. A structural equation model shows a positive influence of complexity on interest, yet a negative influence of comprehensibility, confirming a seemingly paradoxical relationship between complexity and interest. By showing when complexity becomes interesting, this paper shows how information systems can use the model of textual complexity to construct an interesting IX.",
      "type": "Journal paper",
      "researchgroup": "EWI-HMI: Human Media Interaction",
      "researchprogram": "CTIT-NICE: Natural Interaction in Computer-mediated Environments",
      "researchproject": "Puppy-IR: An Open Source Environment to construct Information Services for Children",
      "keywords": "linguistic analysis, user satisfaction, information use, complexity, interest, information retrieval, text mining, communication, psychology, bandwidth",
      "status": "Published",
      "deposited": "2014-07-29",
      "year": 2014,
      "refereed": "Yes",
      "international": "Yes",
      "urls": {
        "doi": "http://dx.doi.org/10.1002/asi.23095",
        "pdf": "http://eprints.eemcs.utwente.nl/24737/01/VanderSluisXX-When_complexity_becomes_interesting.pdf"
      }
    },
    {
      "id": "25143",
      "title": "Foraging Online Social Networks",
      "reference": "Koot, G. and Huis in ’t Veld, M.A.A. and Hendricksen, J. and Kaptein, R. and de Vries, A. and van den Broek, E.L. (2014) Foraging Online Social Networks. In: Proceedings of the 2014 IEEE Joint Intelligence and Security Informatics Conference (JISIC2014), 24-26 Sep 2014, The Hague, The Netherlands. pp. 312-315. IEEE Computer Society. ISBN 978-1-4799-6364-5",
      "abstract": "A concise and practical introduction is given on Online Social Networks (OSN) and their application in law enforcement, including a brief survey of related work. Subsequently, a tool is introduced that can be used to search OSN in order to generate user profiles. Both its architecture and processing pipeline are described. This tool is meant as a flexible framework that supports manual foraging (and not replaces it). As such, we aim to bridge science’s state-of-the-art and current security officer’s practice. This article ends with a brief discussion on privacy and ethical issues and future work.",
      "type": "Contribution to proceedings",
      "researchgroup": "EWI-HMI: Human Media Interaction",
      "researchprogram": "CTIT-NICE: Natural Interaction in Computer-mediated Environments",
      "keywords": "Online Social Networks, forensics, security, information management",
      "status": "Published",
      "deposited": "2014-12-08",
      "year": 2014,
      "refereed": "Yes",
      "international": "Yes",
      "urls": {
        "doi": "http://dx.doi.org/10.1109/JISIC.2014.62",
        "pdf": "http://eprints.eemcs.utwente.nl/25143/01/Koot14-Foraging_Online_Social_Networks.pdf"
      }
    },
    {
      "id": "23355",
      "title": "Motor, emotional, and cognitive empathy in children and adolescents with autism spectrum disorder and conduct disorder",
      "reference": "Bons, D. and van den Broek, E.L. and Scheepers, F. and Herpers, P. and Rommelse, N. and Buitelaar, J.K. (2013) Motor, emotional, and cognitive empathy in children and adolescents with autism spectrum disorder and conduct disorder. Journal of Abnormal Child Psychology, 41 (3). pp. 425-443. ISSN 0091-0627",
      "abstract": "It is unclear which aspects of empathy are shared and which are uniquely affected in autism spectrum disorder (ASD) and conduct disorder (CD) as are the neurobiological correlates of these empathy impairments. The aim of this systematic review is to describe the overlap and specificity of motor, emotional, and cognitive aspects of empathy in children and adolescents with ASD or CD. Motor and cognitive empathy impairments are found in both ASD and CD, yet the specificity seems to differ. In ASD facial mimicry and emotion recognition may be impaired for all basic emotions, whereas in CD this is only the case for negative emotions. Emotional empathy and the role of attention to the eyes therein need further investigation. We hypothesize that impaired motor and cognitive empathy in both disorders are a consequence of lack of attention to the eyes. However, we hypothesize major differences in emotional empathy deficits between ASD and CD, probably due to emotional autonomic and amygdala hyper-responsivity in ASD versus hypo-responsivity in CD, both resulting in lack of attention to the eyes.",
      "type": "Journal paper",
      "researchgroup": "EWI-HMI: Human Media Interaction",
      "researchprogram": "CTIT-NICE: Natural Interaction in Computer-mediated Environments",
      "keywords": "Empathy, Autism spectrum disorders, Conduct disorder, Facial expression, Emotion, physiology, psychology, biosignals, biofeedback, diagnostic support",
      "status": "Published",
      "deposited": "2013-06-10",
      "year": 2013,
      "refereed": "Yes",
      "international": "Yes",
      "isi": "3.01",
      "urls": {
        "doi": "http://dx.doi.org/10.1007/s10802-012-9689-5",
        "pdf": "http://eprints.eemcs.utwente.nl/23355/01/Bons13-Motor_emotional_and_cognitive_empathy_in_children_and_adolescents_with_autism_and_conduct_disorder.pdf"
      }
    },
    {
      "id": "23237",
      "title": "Affective computing",
      "subtitle": "a reverence for a century of research",
      "reference": "van den Broek, E.L. (2012) Affective computing: a reverence for a century of research. In: Cognitive Behavioural Systems. Lecture Notes in Computer Science 7403. Springer-Verlag, Berlin Heidelberg, pp. 434-448. ISSN 0302-9743 ISBN 978-3-642-34583-8",
      "abstract": "To bring affective computing a leap forward, it is best to start with a step back. A century of research has been conducted on topics, which are crucial for affective computing. Understanding this vast amount of research will accelerate progress on affective computing. Therefore, this article provides an overview of the history of affective computing. The complexity of affect will be described by discussing i) the relation between body and mind, ii) cognitive processes (i.e., attention, memory, and decision making), and iii) affective computing’s I/O. Subsequently, definitions are provided of affect and related constructs (i.e., emotion, mood, interpersonal stances, attitude, and personality traits) and of affective computing. Perhaps when these elements are embraced by the community of affective computing, it will us a step closer in bridging its semantic gap.",
      "type": "Book chapter",
      "researchgroup": "EWI-HMI: Human Media Interaction",
      "researchprogram": "CTIT-NICE: Natural Interaction in Computer-mediated Environments",
      "researchproject": "BrainGain/2: BCI applications for healthy users, COMMIT/P04+P05: Virtual Worlds for Well-being",
      "additionalinfo": "Invited contribution for the COST 2102 International Training School, Dresden, Germany, February 21-26, 2011, Revised Selected Papers",
      "keywords": "affect, emotion, affective computing, biosignals, history, complexity, definitions, semantic gap",
      "status": "Published",
      "deposited": "2013-05-02",
      "year": 2013,
      "refereed": "Yes",
      "international": "Yes",
      "urls": {
        "doi": "http://dx.doi.org/10.1007/978-3-642-34584-5_39",
        "pdf": "http://eprints.eemcs.utwente.nl/23237/01/VandenBroek12-Affective_computing-A_reverence_for_a_century_of_research.pdf"
      }
    },
    {
      "id": "20760",
      "title": "Tune in to your emotions",
      "subtitle": "A robust personalized affective music player",
      "reference": "Janssen, J.H. and van den Broek, E.L. and Westerink, J.H.D.M. (2012) Tune in to your emotions: A robust personalized affective music player. User Modeling and User-Adapted Interaction, 22 (3). pp. 255-279. ISSN 0924-1868",
      "abstract": "The emotional power of music is exploited in a personalized affective music player (AMP) that selects music for mood enhancement. A biosignal approach is used to measure listeners’ personal emotional reactions to their own music as input for affective user models. Regression and kernel density estimation are applied to model the physiological changes the music elicits. Using these models, personalized music selections based on an affective goal state can be made. The AMP was validated in real-world trials over the course of several weeks. Results show that our models can cope with noisy situations and handle large inter-individual differences in the music domain. The AMP augments music listening where its techniques enable automated affect guidance. Our approach provides valuable insights for affective computing and user modeling, for which the AMP is a suitable carrier application.",
      "type": "Journal paper",
      "researchgroup": "EWI-HMI: Human Media Interaction",
      "researchprogram": "CTIT-NICE: Natural Interaction in Computer-mediated Environments",
      "researchproject": "BrainGain/2: BCI applications for healthy users",
      "keywords": "Mood, music, psychophysiology, user modeling, kernel density estimation, validation, affective computing",
      "status": "Published",
      "deposited": "2012-04-18",
      "year": 2012,
      "refereed": "Yes",
      "international": "Yes",
      "isi": "1.60",
      "urls": {
        "doi": "http://dx.doi.org/10.1007/s11257-011-9107-7",
        "pdf": "http://eprints.eemcs.utwente.nl/20760/01/JanssenXX-A_robust_personalized_affective_music_player_PREPRINT.pdf"
      }
    },
    {
      "id": "20812",
      "title": "Affective Signal Processing (ASP)",
      "subtitle": "Unraveling the mystery of emotions",
      "reference": "van den Broek, E.L. (2011) Affective Signal Processing (ASP): Unraveling the mystery of emotions. PhD thesis, University of Twente. CTIT Ph.D.-thesis series No. 11-204 ISBN 978-90-365-3243-3",
      "abstract": "Slowly computers are being dressed and becoming huggable and tangible. They are being personalized and are expected to understand more of their users' feelings, emotions, and moods: This we refer to as affective computing. The work and experiences from 50+ publications on affective computing is collected and reported in one concise monograph. A brief introduction on emotion theory and affective computing is given and its relevance for computer science (i.e., Human-Computer Interaction, Artificial Intelligence (AI), and Health Informatics) is denoted. Next, a closed model for affective computing is introduced and reviews of both biosignals and affective computing are presented. The conclusion of all of this is that affective computing lacks standards. Affective computing's key dimensions need to be identified and studied to bring the field the progress it needs. A series of studies is presented that explore baseline-free affective computing, the influence of a range of distinct triggers for emotions, the influence of time windows, several combinations of biosignals with and without speech, the impact of the context, the personality traits neuroticism and extroversion, and demographics. Moreover, a complete signal processing + classification processing pipeline for affective computing is developed and executed on the data gathered. This pipeline is also applied on two clinical case studies, which proves that affective computing is already feasible in clinical practice; that is, Computer Aided Diagnosis (CAD) for patients suffering from a Post-Traumatic Stress Disorder (PTSD). A set of key dimensions for affective computing and, subsequently, prerequisites and guidelines are defined, based on the author's work and experiences. Moreover, historical, emotion theoretical, and computer science perspectives are taken to reflect upon the work and five applications (i.e., next-generation TV, knowledge representations, CAD, robot nannies, and digital human models) are presented to illustrate the field's future impact. If anything, this monograph shows that affective computing will become unstoppable, will determine our relation with ICT and, as such, will reshape our lives.",
      "type": "Dissertation",
      "supervisors": "Nijholt, A. and Dijkstra, T.",
      "assistantsupervisors": "Westerink, J.H.D.M",
      "researchgroup": "EWI-HMI: Human Media Interaction",
      "researchprogram": "CTIT-NICE: Natural Interaction in Computer-mediated Environments",
      "researchproject": "BrainGain/2: BCI applications for healthy users",
      "additionalinfo": "A review of this PhD thesis can be found at: Esposito, A. (2012). Affective Signal Processing (ASP): Unraveling the mystery of emotions, by Egon L. van den Broek. Journal of Ambient Intelligence and Smart Environments, 4(1), 75-76. DOI/URL: http://dx.doi.org/10.3233/AIS-2011-0131",
      "keywords": "Affective Signal Processing, ASP, affective computing, affect, emotion, biosignals, psychophysiology, speech, machine learning, pattern recognition, statistics, experimentation, modeling, validity, validation, guidelines, prerequisites, review, overview",
      "deposited": "2011-11-22",
      "year": 2011,
      "urls": {
        "doi": "http://dx.doi.org/10.3990/1.9789036532433",
        "pdf": "http://eprints.eemcs.utwente.nl/20812/01/VandenBroek11-Affective_Signal_Processing_ASP2.pdf"
      }
    }
  ]
}
